doc/SPG-makeFullFundTransfer-Req.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.nbc.org.kh/">
	<soapenv:Header/>
	<soapenv:Body>
		<web:makeFullFundTransfer>
			<web:cm_user_name>spgapp</web:cm_user_name>
			<web:cm_password>PAsssww222025</web:cm_password>
			<web:ext_ref>NBCOKHPPXXX/NBHQKHPPXXX/RFOBS450584</web:ext_ref>
			<web:iso_message><![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
            <Document xsi:schemaLocation="xsd/pain.001.001.05.xsd" xmlns="urn:iso:std:iso:20022:tech:xsd:pain.001.001.05" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <CstmrCdtTrfInitn>
                    <GrpHdr>
                        <MsgId>CRTNBHQKHPPXXX450584</MsgId>
                        <CreDtTm>2026-01-19T18:00:00.000+07:00</CreDtTm>
                        <NbOfTxs>1</NbOfTxs>
                        <CtrlSum>244226358</CtrlSum>
                        <InitgPty>
                            <Nm>National Bank of Cambodia</Nm>
                        </InitgPty>
                    </GrpHdr>
                    <PmtInf>
                        <PmtInfId>NBCOKHPPXXX/NBHQKHPPXXX/RFOBS450584</PmtInfId>
                        <PmtMtd>TRF</PmtMtd>
                        <BtchBookg>false</BtchBookg>
                        <ReqdExctnDt>2026-01-19</ReqdExctnDt>
                        <Dbtr>
                            <Nm>National Bank of Cambodia</Nm>
                        </Dbtr>
                        <DbtrAcct>
                            <Id>
                                <Othr>
                                    <Id>000000018008</Id>
                                </Othr>
                            </Id>
                            <Ccy>KHR</Ccy>
                        </DbtrAcct>
                        <DbtrAgt>
                            <FinInstnId>
                                <BICFI>NBCOKHPPXXX</BICFI>
                            </FinInstnId>
                        </DbtrAgt>
                        <CdtTrfTxInf>
                            <PmtId>
                                <InstrId>NBCOKHPPXXX/RFOBS450584</InstrId>
                                <EndToEndId>000000018008-000000001111</EndToEndId>
                            </PmtId>
                            <Amt>
                                <InstdAmt Ccy="KHR">244226358</InstdAmt>
                            </Amt>
                            <ChrgBr>CRED</ChrgBr>
                            <CdtrAgt>
                                <FinInstnId>
                                    <BICFI>NBHQKHPPXXX</BICFI>
                                </FinInstnId>
                            </CdtrAgt>
                            <Cdtr>
                                <Nm>National Bank of Cambodia</Nm>
                            </Cdtr>
                            <CdtrAcct>
                                <Id>
                                    <Othr>
                                        <Id>000000001111</Id>
                                    </Othr>
                                </Id>
                            </CdtrAcct>
                            <Purp>
                                <Cd>GDDS</Cd>
                            </Purp>
                            <RmtInf>
                                <Ustrd>Refund-OBS-450584</Ustrd>
                                <Strd>
                                    <RfrdDocInf>
                                        <Tp>
                                            <CdOrPrtry>
                                                <Cd>CINV</Cd>
                                            </CdOrPrtry>
                                        </Tp>
                                        <Nb>1</Nb>
                                        <RltdDt>2026-01-19+07:00</RltdDt>
                                    </RfrdDocInf>
                                    <AddtlRmtInf>Phnom Penh/RFOBS450584</AddtlRmtInf>
                                </Strd>
                            </RmtInf>
                        </CdtTrfTxInf>
                    </PmtInf>
                </CstmrCdtTrfInitn>
            </Document>]]></web:iso_message>
		</web:makeFullFundTransfer>
	</soapenv:Body>
</soapenv:Envelope>